[
  {
    "id": "P001",
    "productImg": "http://localhost:3005/public/img/productsPic/beef_noodles.jpg",
    "productTitle": "Beef Noodles",
    "productIngredients": "Beef broth, beef, chili oil, cilantro, garlic, pickled carrots, spicy",
    "ProductDescr": "Lanzhou Beef Noodles, a common noodle in mainland China, is called Beef Noodles or Beef Bowl in Lanzhou, Gansu Province. The chef stretches the dough into noodles by hand, cooks them in a pot, then adds beef broth and sprinkles small pieces of beef, chili oil, coriander and garlic on top. A bowl of fragrant beef noodles is ready. It only takes about two minutes from the time the customer orders the noodles to the time the noodles are finished, so the beef noodles are very popular as a quick breakfast in Lanzhou.",
    "vendorInfo": {
      "vendorName": "Lanzhou Beef Noodles",
      "vendor_id": "V002",
      "vendor_adrs": "Guangzhou"
    },
    "price": 20,
    "rating": 3,
    "tags": ["Gansu", "beef", "spicy", "soup"]
  },
  {
    "id": "P002",
    "productImg": "http://localhost:3005/public/img/productsPic/spicy-chicken-noodles.jpeg",
    "productTitle": "Spicy Chicken Noodles",
    "productIngredients": "chicken meat, green pepper, potatoes, carrots, onions, spicy, beer",
    "ProductDescr": "Spicy chicken noodles (also known as Turkey Spicy noodles) have become a popular spicy noodle dish because of their pungent, spicy flavor that has made many people bold enough to try them!The spicy chicken fried noodle mix can even bring tears to your eyes, but after eating it, you can't stop crying. Those who have eaten it will be amazed at how time can produce such a fascinating food. In the cold winter months, more and more people are opting for spicy chicken fried noodles.",
    "vendorInfo": {
      "vendorName": "Henan Stewed Noodles",
      "vendor_id": "V009",
      "vendor_adrs": "Guangzhou"
    },
    "price": 15,
    "rating": 3,
    "tags": ["Henan", "chicken", "spicy", "no soup"]
  },
  {
    "id": "P003",
    "productImg": "http://localhost:3005/public/img/productsPic/chong_qing_small_noodles.jpg",
    "productTitle": "Chongqing Street Noodles",
    "productIngredients": "Chicken extract, soy sauce, chili oil, pepper noodles,small noodles, meat, vegetables, peas, peanuts, fried eggs",
    "ProductDescr": "Chongqing Xiaomian is the simplest type of Chongqing noodles. Chongqing Xiaomian refers to spicy vegetarian noodles with a spicy flavor. Chongqing Xiaomian also includes Chongqing Xiaomian and noodles with shyness, such as beef, fatty sausage, noodles with peas and mixed sauce, and Rongchang pavlova noodles. At noodle stores, you can ask them to make your own customized noodle dishes, such as mixed noodles, hard noodles, more vegetables, more spicy oil, and so on. Seasonings are the soul of Chongqing Xiaomian, and a bowl of noodles is all about flavor. A bowl of noodles depends on the seasoning to bring out the flavor. The spicy flavor is balanced without irritation, the noodles are strong and smooth, and the soup is aromatic and full of flavor.",
    "vendorInfo": {
      "vendorName": "See You Again Noodles",
      "vendor_id": "V010",
      "vendor_adrs": "Guangzhou"
    },
    "price": 10,
    "rating": 3.5,
    "tags": ["Chongqing", "pork", "spicy", "soup"]
  },
  {
    "id": "P004",
    "productImg": "http://localhost:3005/public/img/productsPic/you_po_noodles.jpeg",
    "productTitle": "You Pour Noodles",
    "productIngredients": "Noodles, greens, chopped green onions, pepper, chili,noodles, peanuts, spicy",
    "ProductDescr": "You Pour noodles are one of the traditional specialty noodle dishes in Shaanxi province, originated in the Ming Dynasty, with fresh, sour and spicy flavors. After boiling the handmade noodles in boiling water, put them in a bowl, put chopped green onion, pepper powder, salt and other ingredients on the surface with a thick layer of chili noodles, and pour hot vegetable oil on top of the seasoning, then the hot oil boils, and the pepper noodles and chili noodles will be cooked and red. You can also add preserved pork, green pepper shredded potatoes, green pepper egg, tomato egg, etc. to serve.",
    "vendorInfo": {
      "vendorName": "Old Shanxi Daoxiao Noodles Shop",
      "vendor_id": "V003",
      "vendor_adrs": "Guangzhou"
    },
    "price": 12,
    "rating": 4,
    "tags": ["shanxi", "spicy", "no soup"]
  },
  {
    "id": "P005",
    "productImg": "http://localhost:3005/public/img/productsPic/luosi_noodles.jpg",
    "productTitle": "Liuzhou River Snails Rice Noodle",
    "productIngredients": "Rice vermicelli, pickled asparagus, fungus, peanuts, fried,bean curd, cauliflower, fresh green vegetables",
    "ProductDescr": "River Snails noodles are a flavorful snack of Liuzhou, Guangxi. It is made of Liuzhou's unique rice noodles with ingredients such as sour bamboo shoots, fungus, peanuts, fried bean curd sticks, cauliflower, fresh green vegetables, etc. and moderately sour and spicy flavor and the soup of boiled snail. Authentic river snail noodles do not contain river snail meat, only the soup is boiled with river snail. The most distinctive feature of river snail noodle soup is that the soup base has spicy and fishy taste. The soup of river snail is made from Liuzhou green snail with pork barrel bone and various spices. Since the soup base of river snail noodles varies from house to house, the taste of river snail noodles varies slightly from store to store. The carefully simmered river snail soup has the flavor of clear but not light, hemp but not dry, spicy but not hot, fragrant but not greasy. Its main ingredient is dry rice noodles, which is different from rice noodles and rice noodles. Usually, dry rice noodles, which are unique to Liuzhou, are used to make the soup. Dried rice noodles are made from old rice and soaked in water to soften before being cooked.",
    "vendorInfo": {
      "vendorName": "Zhou's River Snails Rice Noodle Shop",
      "vendor_id": "V004",
      "vendor_adrs": "Guangzhou"
    },
    "price": 18,
    "rating": 4,
    "tags": ["guangxi", "hot", "soup", "pork"]
  },
  {
    "id": "P006",
    "productImg": "http://localhost:3005/public/img/productsPic/three_shrimp_noodles.jpg",
    "productTitle": "Three Shrimp Noodles",
    "productIngredients": "Noodles, shrimp noodles, shrimp brains, shrimp roe",
    "ProductDescr": "Three Prawn Noodle is a noodle snack in Shanghai and Suzhou. The colors are bright, the noodles are soft and smooth, and the soup is rich and flavorful. The so-called 'three shrimps', namely shrimp seeds, shrimp brains and shrimp kernel, are the most precious things on the shrimp. In the early 1920s, some famous restaurants in Shanghai made 'Three Shrimp Noodles' from shrimp and noodles as a snack for high-class banquets, which was later sold by many noodle shops as a good summer noodle dish.",
    "vendorInfo": {
      "vendorName": "Old Shanghai Noodle Shop",
      "vendor_id": "V006",
      "vendor_adrs": "Guangzhou"
    },
    "price": 99,
    "rating": 4.5,
    "tags": ["shanghai", "soup", "shrimp"]
  },
  {
    "id": "P007",
    "productImg": "http://localhost:3005/public/img/productsPic/daoxiaomian_small.jpg",
    "productTitle": "Sliced Noodles",
    "productIngredients": "pork foreleg,Pixian bean paste,sweet sauce,onions,ginger,carrots",
    "ProductDescr": "Knife-Sliced noodles is a characteristic traditional noodle dish in Shanxi province, and is one of the 'Top Ten Noodles in China'. Knife-shaved noodles are popular in Shanxi province and its surrounding areas, and it is said to have been created by the emperor's prince-brother Cai Shao in the Tang Dynasty. Shanxi knife-shaved noodles are thin and thick in the middle, shaped like a willow leaf; the entrance is smooth and soft but not sticky, and the more it is chewed, the better it smells. It is known as one of the top five noodle dishes in China, along with the Beijing's fried noodles, Henan's stewed noodles, Hubei's hot dry noodles, and Sichuan's tantan noodles, and is one of the most representative business cards of Shanxi cuisine.",
    "vendorInfo": {
      "vendorName": "Old Shanxi Daoxiao Noodles Shop",
      "vendor_id": "V003",
      "vendor_adrs": "Guangzhou"
    },
    "price": 12.5,
    "rating": 4,
    "tags": ["shanxi", "soup", "spicy", "pork"]
  },
  {
    "id": "P008",
    "productImg": "http://localhost:3005/public/img/productsPic/liangbanmian_small.jpg",
    "productTitle": "Cold Noodles",
    "productIngredients": "Ginger garlic oil,sesame oil,chili oil, cucumber, bean sprouts, red pepper, ground peanuts.",
    "ProductDescr": "Cold noodles, commonly referred to as Korean cold noodles, are a popular traditional ethnic food both at home and abroad. It is especially famous for its soba noodles, which are usually served in beef or chicken broth. It is usually served in beef or chicken broth with spicy cabbage, sliced meat, egg, cucumber, pear sticks, etc. It is served in a bowl with a small amount of cold broth. When eating, first put a small amount of cold soup in the bowl with the right amount of noodles, then put the condiments, and finally pour the soup again. The noodles are thin and tough, and the soup is cool, spicy and sour to taste.",
    "vendorInfo": {
      "vendorName": "Chongqing Hu's Noodle Shop",
      "vendor_id": "V005",
      "vendor_adrs": "Guangzhou"
    },
    "price": 8,
    "rating": 4,
    "tags": ["Sichuan", "no soup", "spicy"]
  },
  {
    "id": "P009",
    "productImg": "http://localhost:3005/public/img/productsPic/liminmian_xiajiangmian.jpg",
    "productTitle": "Shrimp Paste Noodles",
    "productIngredients": "Fresh shrimp, salsa, garlic, oyster sauce, and pepper.",
    "ProductDescr": "Shrimp paste noodle is a home-style noodle dish made from fresh shrimp, garlic, sauce, oil and warm water.",
    "vendorInfo": {
      "vendorName": "Old Shanxi Daoxiao Noodles Shop",
      "vendor_id": "V003",
      "vendor_adrs": "Guangzhou"
    },
    "price": 24.5,
    "rating": 4,
    "tags": ["Shanghai", "soup", "Shrimp"]
  },
  {
    "id": "P010",
    "productImg": "http://localhost:3005/public/img/productsPic/nanjing_laolumian.jpeg",
    "productTitle": "Noodles with Gravy",
    "productIngredients": "Pork, eggs, young cabbage, mushrooms, dried fungus, carrots, green onions, cilantro, fennel.",
    "ProductDescr": "Old braised noodles used to be the number one noodle dish in Nanjing, and before the 1980s, most of the noodle shops in Nanjing were made up of old braised noodles. old braised noodles are noodles in red broth, heavy braised sauce, heavy broth, and heavy toppings, and there are many different kinds of toppings, such as big meat, beef, small steak, eel, and large steak. etc. In the case of big meat, for example, the meat is cooked until it is seven or eight ripe and then deep-fried in a deep fryer until it looks like a tiger skin, then covered with noodles and served on the table. In the case of old braised noodles in Nanjing, a spoonful of simmering marinade is usually placed in a bowl, then mixed with the noodle soup, and the noodles are then picked up and topped with the toppings. When you stir the noodles with chopsticks, the noodles are immediately colored and the aroma becomes even more intense.",
    "vendorInfo": {
      "vendorName": "Old Shanxi Daoxiao Noodles Shop",
      "vendor_id": "V003",
      "vendor_adrs": "Guangzhou"
    },
    "price": 16.5,
    "rating": 3.5,
    "tags": ["Nanjing", "soup", "pork"]
  },
  {
    "id": "P011",
    "productImg": "http://localhost:3005/public/img/productsPic/niurousaozimian.jpg",
    "productTitle": "Minced Beef Qishan Noodles",
    "productIngredients": "Ground beef,carrots,tofu,beans,cauliflower,eggs,fungus.",
    "ProductDescr": "Saozi noodles is one of the special traditional noodle dishes in Shaanxi Province, China, and is a famous Xifu snack, with Baoji's Qishan saozi Noodles being the most authentic. It is popular in the Guanzhong Plain in Shaanxi and Longdong in Gansu. It has a long history and contains side dishes such as tofu and egg, which are simple to prepare. The word ‘saozi' means diced meat. For Shaanxi people, the color of the noodles is especially important: yellow egg skin, black fungus, red carrots, green garlic, white tofu and other ingredients make them beautiful and delicious.",
    "vendorInfo": {
      "vendorName": "Old Shanxi Daoxiao Noodles Shop",
      "vendor_id": "V003",
      "vendor_adrs": "Guangzhou"
    },
    "price": 12.5,
    "rating": 4,
    "tags": ["Shanxi", "soup", "beef", "spicy"]
  },
  {
    "id": "P012",
    "productImg": "http://localhost:3005/public/img/productsPic/wangeryangroumian.jpg",
    "productTitle": "Mutton Noodles",
    "productIngredients": "Lamb,scallions,coriander,red onions,dried chillies.",
    "ProductDescr": "Northwestern cuisine, especially Xi'an Beef and Lamb Noodles, is the most famous. It is finely cooked, heavy in material and taste, rich in meat and soup, fatty but not greasy, nutritious, with an overflowing aroma that tempts people's appetite and endless aftertaste. Because it warms the stomach and makes no hungry, it has always been loved by visitors to Xi'an and northwest China. Beef and mutton noodles have become the representative of Shaanxi cuisine.",
    "vendorInfo": {
      "vendorName": "Wang's Lamb Noodle Shop",
      "vendor_id": "V008",
      "vendor_adrs": "Guangzhou"
    },
    "price": 22.5,
    "rating": 4.5,
    "tags": ["Shanxi", "soup", "Lamb", "spicy"]
  },
  {
    "id": "P013",
    "productImg": "http://localhost:3005/public/img/productsPic/yunnan_ganbanmian_small.jpg",
    "productTitle": "Dried Noodles",
    "productIngredients": "Pork sauce, cilantro, pickled peppers, pickled radishes, straw mushrooms, celery, bean paste.",
    "ProductDescr": "Pork sauce cold noodles are spicy, sweet and sour, with a spicy appetizing aftertaste. Compared with other noodle dishes, chicken noodle is less greasy and is very popular in the summer. The low-fat and high-protein pork breast, together with seasonal vegetables and the secret seasoning sauce, all the fragrance comes out in just one bowl of noodles, which makes people's mouths water.",
    "vendorInfo": {
      "vendorName": "Wu Choi Kee Noodle Shop",
      "vendor_id": "V007",
      "vendor_adrs": "Guangzhou"
    },
    "price": 18.5,
    "rating": 3.5,
    "tags": ["Yunnan", "no soup", "Pork", "hot"],
    "reviews": []
  },
  {
    "id": "P014",
    "productImg": "http://localhost:3005/public/img/productsPic/yunnan_xiaoguomixian_small.jpg",
    "productTitle": "Over-the-bridge Rice Noodles",
    "productIngredients": "Pork sauce, Pea tips, leeks, coriander, shredded green onions, sprouts, ginger, magnolia chips, wild mushrooms.",
    "ProductDescr": "Cross-bridge rice noodles is a unique snack in southern Yunnan Province, belonging to the Yunnan cuisine, the dish originated in the Mengzi region, is made from soup, condiments, raw slices of pork loin, chicken breast, mullet slices and five mature slices of pork loin, belly slices, squid slices.\nIngredients include pea tips and leeks, as well as coriander, green onions, grass sprouts, ginger, magnolia slices, blanching tofu skin; the fourth is the staple, which is rice noodles slightly scalded with water. Covered with goose oil, the soup is hot, but not steamy.",
    "vendorInfo": {
      "vendorName": "Wu Choi Kee Noodle Shop",
      "vendor_id": "V007",
      "vendor_adrs": "Guangzhou"
    },
    "price": 20,
    "rating": 3.5,
    "tags": ["Yunnan", "soup", "Pork", "rice noodles"]
  },
  {
    "id": "P015",
    "productImg": "http://localhost:3005/public/img/productsPic/zhuShengmian_Guangdong.jpg",
    "productTitle": "Zhusheng Noodles",
    "productIngredients": "Cantonese slim noodles mixed with salted duck egg, Soy sauce, salt, green onions.",
    "vendorInfo": {
      "vendorName": "Kin Kee Noodle Shop",
      "vendor_id": "V001",
      "vendor_adrs": "Guangzhou"
    },
    "price": 20,
    "rating": 3.5,
    "tags": ["Guangdong", "soup"]
  },
  {
    "id": "P016",
    "productImg": "http://localhost:3005/public/img/productsPic/ganchaoniuhe_guangdong.jpg",
    "productTitle": "Stir-Fried Rice Noodles with Beef",
    "productIngredients": "Rice noodles, shredded beef, leeks, green onions, mung bean sprouts.",
    "ProductDescr": "Stir-fried beef noodle is a specialty snack in Guangzhou City, Guangdong Province, belonging to the Cantonese cuisine. River noodles, also known as Shahe noodles, originated from Shahe Town, Guangzhou. It is usually cooked in soup or stir-fried. Dry stir-fried beef river is considered a major test of Guangdong chef's stir-frying skills, and it is easy to tell if the skill is good or bad.",
    "vendorInfo": {
      "vendorName": "Kin Kee Noodle Shop",
      "vendor_id": "V001",
      "vendor_adrs": "Guangzhou"
    },
    "price": 16,
    "rating": 4,
    "tags": ["Guangdong", "no soup", "beef"]
  },
  {
    "id": "P017",
    "productImg": "http://localhost:3005/public/img/productsPic/wuhan_hot_try_noodles.jpg",
    "productTitle": "Wuhan hot-dry noodles with sesame paste",
    "productIngredients": "Sesame sauce, soy sauce, diced spicy radish, diced pickled vegetables, chopped green onion, chili oil, monosodium glutamate, pepper, vinegar, snow pepper, chicken broth and other condiments",
    "ProductDescr": "Hot dry noodles is a special breakfast in Hubei, and it has become the first choice of many Wuhan people in the morning because of its convenience and deliciousness. Hot dry noodles can be found everywhere in the streets and alleys of Wuhan, and it is not only a special food of Wuhan, but also very popular in many places in Hubei. The noodles are made of alkaline water and supplemented with various ingredients such as sesame sauce, green onions and spicy radish.",
    "vendorInfo": {
      "vendorName": "Wu Choi Kee Noodle Shop",
      "vendor_id": "V007",
      "vendor_adrs": "Guangzhou"
    },
    "price": 12,
    "rating": 4,
    "tags": ["Guangdong", "no soup", "chicken", "beef"]
  }
]
